export interface Slide {
    id: number;
    title: string;
    text: string;
}

export type SlidesData = {
    [key: number]: Slide[];
};


export const slidesByOption: SlidesData = {
    0: [
        {
            id: 1,
            title: '1980',
            text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
        },
        {
            id: 2,
            title: '1981',
            text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11"
        },
        {
            id: 3,
            title: '1982',
            text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
        },
        {
            id: 4,
            title: '1983',
            text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
        },
        {
            id: 5,
            title: '1984',
            text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11"
        },
    ],
    1: [
        {
            id: 1,
            title: '1987',
            text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
        },
        {
            id: 2,
            title: '1988',
            text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11"
        },
        {
            id: 3,
            title: '1989',
            text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
        },
        {
            id: 4,
            title: '1990',
            text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
        },
        {
            id: 5,
            title: '1991',
            text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11"
        },
    ],
    2: [
        {
            id: 1,
            title: '1992',
            text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
        },
        {
            id: 2,
            title: '1993',
            text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11"
        },
        {
            id: 3,
            title: '1994',
            text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
        },
        {
            id: 4,
            title: '1995',
            text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
        },
        {
            id: 5,
            title: '1996',
            text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11"
        },
        {
            id: 6,
            title: '1997',
            text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
        },
    ],
    3: [
        {
            id: 1,
            title: '1999',
            text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
        },
        {
            id: 2,
            title: '2000',
            text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11"
        },
        {
            id: 3,
            title: '2001',
            text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
        },
        {
            id: 4,
            title: '2002',
            text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
        },
        {
            id: 5,
            title: '2003',
            text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11"
        },
        {
            id: 6,
            title: '2004',
            text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
        },
    ],
    4: [
        {
            id: 1,
            title: '2005',
            text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
        },
        {
            id: 2,
            title: '2006',
            text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11"
        },
        {
            id: 3,
            title: '2007',
            text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
        },
        {
            id: 4,
            title: '2008',
            text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
        },
        {
            id: 5,
            title: '2009',
            text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11"
        },
        {
            id: 6,
            title: '2010',
            text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
        },
    ],
    5: [
        {
            id: 1,
            title: '2015',
            text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
        },
        {
            id: 2,
            title: '2016',
            text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11"
        },
        {
            id: 3,
            title: '2017',
            text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
        },
        {
            id: 4,
            title: '2018',
            text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
        },
        {
            id: 5,
            title: '2019',
            text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11"
        },
        {
            id: 6,
            title: '2020',
            text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
        },
        {
            id: 7,
            title: '2021',
            text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
        },
        {
            id: 8,
            title: '2022',
            text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11"
        },
    ],
};
